{
    "cole_palmer": {
      "joined": "Cole Palmer joined from Manchester City on transfer deadline day in September 2023.",
      "paragraphs": [
        "A young attacking player of outstanding all-round quality who can create and score  goals, his first year at Stamford Bridge could hardly have gone better as he was awarded Player of the Season and became a full England international. In July 2024, he scored for his nation in the European Championship final versus Spain.Ahead of the start of the 2024/25 campaign, there was good news for Chelsea fans when Palmer signed a two-year contract extension, committing him to the club until 2033. Very soon after he was one of the nominees for the prestigious Ballon d’Or and he was ranked 25th for that award when the vote result was announced."
      ],
      "mainImage": "image/cole_main.png",
      "image": "image/cole_info.png",
      "shirtNum" : "10",
      "accordion": [
        {
          "title": "2023/24",
          "content": [
            { "type": "p", "text": "Palmer made his Chelsea debut coming on as a substitute at home to Nottingham Forest, one day after his signing. His first start came in his fourth appearance, a Carabao Cup win over Brighton in which he provided the assist for the only goal, with his own first Chelsea goal coming two games later when he converted a penalty. That was in a 4-1 win at Burnley in October 2023." },
            { "type": "p", "text": "Having quickly become a surefire name on the team sheet and the first-choice penalty taker, Palmer's first four goals came from the spot, including a stoppage-time equaliser against his former club Man City, the day before he received his first call-up into the England senior squad. He registered four assists over the same period." },
            { "type": "img", "src": "image/cole_2324_1.png", "title": "Palmer nets his third Chelsea Penalty", "desc": "" },
            { "type": "p", "text": "Open-play goals followed during his outstanding start at his new club, and his second in a win at Luton, a marvellously adept skip past the goalkeeper and finish, was voted Chelsea's Goal of the Month for December and was nominated for the equivalent Premier League award. Palmer was also on the shortlist for the Premier League’s Player of the Month." },
            { "type": "p", "text": "Two goals in a big win against Middlesbrough in the semi-final second leg earned him the Carabao Cup's Player of the Round." },
            { "type": "p", "text": "Palmer's remarkable first Chelsea campaign accelerated still further when in March and April he scored 11 goals in just six games, including a hat-trick with two at the death against Man United to turn looming defeat into victory, and four past Everton including a first-half hat-trick. The first goal that day won a Premier League Goal of the Month award, and he was also named Premier League Player of the Season for April, the first Chelsea recipient since Eden Hazard in 2018, and the second youngest after Arjen Robben." },
            { "type": "img", "src": "image/cole_2324_2.png", "title": "Palmer wins Premier League Goal of the Month!", "desc": "Cole Palmer's strike against Everton has won the Premier League Goal of the Month award for April" },
            { "type": "p", "text": "Then following month Palmer became the first Chelsea player to reach 30 Premier League goal involvements in a season while aged 21 or younger." },
            { "type": "p", "text": "Honour followed honour followed honour - as at the Chelsea Annual Awards night Palmer picked up the Chelsea Player of the Year voted for by the fans, as well as the Players' Player of the Year Award. He was named the Premier League’s Young Player of the Season and the PFA Premier League Fans’ Player of the Year. He later collected the PFA Young Player of the Year for the season." },
            { "type": "p", "text": "By the season’s end, his 45 Chelsea games had served up 25 goals, 22 of them in the Premier League which was bettered only by Man City’s Erling Haaland with 27. His 11 assists was the second-highest tally too, behind Villa’s Ollie Watkins on 13." },
            { "type": "img", "src": "image/cole_2324_3.png", "title": "Palmer’s first season in blue 🚀 2023/24", "desc": "46 appearances, 25 goals, 15 assists and six end-of-season awards, including Chelsea's Player of the Season. What a year, Cole!" },
            { "type": "p", "text": "Palmer joined Didier Drogba and Frank Lampard to become the third Chelsea player to score 20 or more goals and provide at least 10 assists in a Premier League season, and his 25 goals across all competitions in a single season was the most by a Chelsea player since those two in the double-winning campaign of 2009/10." }
          ]
        },
        {
          "title": "2024/25",
          "content": [
            { "type": "p", "text": "Palmer began the new season with a two-year extension to his contract under his belt, taking him up to 2033. Meanwhile, his preceding year continued to be recognised with a ranking of 25th for Ballon d'Or and the winning of the PFA Young Player of the Year award." },
            { "type": "p", "text": "Typically, his first goal of the season, a precise lob in a 6-2 win at Wolverhampton Wanderers, won both the Premier League and the Chelsea goal of the month for August." },
            { "type": "img", "src": "image/cole_2425_1.png", "title": "Palmer’s genius lob vs Wolves!", "desc": "Re-live Cole Palmer’s exquisite lob against Wolverhampton Wanderers at Molineux…" },
            { "type": "p", "text": "The next month, in the next game after netting away in a win at West Ham, Palmer became the first player in Premier League history to score four times in the first half of a match only Jimmy Greaves had done so in a Chelsea game before and Palmer joined four other Blues in scoring at least four goals twice in a top-flight league game." },
            { "type": "p", "text": "Among his quadruple of strikes at home to Brighton was a stunning free-kick which was voted Chelsea goal of the month." },
            { "type": "p", "text": "With five goals and an assist in September, he was unsurprisingly named Premier League Player of the Month, a month that had begun with his 50th Chelsea appearance in a home meeting with Crystal Palace." },
            { "type": "img", "src": "image/cole_2425_2.png", "title": "Cole's super September! 🤩", "desc": "Re-live Cole Palmer's award-winning Player of the Month performances during September..." },
            { "type": "p", "text": "Another goal and another assist followed in October, as did another nomination for Player of the Month. A winner at home against Newcastle at the end of that month was voted Chelsea's best goal in October." },
            { "type": "img", "src": "image/cole_2425_3.png", "title": "Palmer wins October GOTM! 💥", "desc": "Re-live Cole Palmer's piledriver during Chelsea's 2-1 Premier League win against Newcastle United at Stamford Bridge..." },
            { "type": "p", "text": "By scoring our third goal in a 3-0 win over Aston Villa at the start of December, Palmer became the second-quickest Chelsea player to score 30 Premier League goals. It had taken him 46 games with only Jimmy Floyd Hasselbaink's 41 games proving faster. The following day he was named on the FIFPRO Men's World XI shortlist having the previous week been nominated for The Best FIFA Men's XI." },
            { "type": "p", "text": "That same month, in a remarkable game at Tottenham when the Blues recovered from 2-0 down to win 4-3, Palmer scored two penalties and played a major part in an Enzo Fernandez goal." },
            { "type": "p", "text": "The first of his penalties made it 37 Premier League goal contributions (goals or assists) in 2024, beating Hasselbaink’s club record set in 2001. The second, a coolly taken panenka perfect for his 'Cold Palmer' nickname, took him level with Hasselbaink's 12 out of 12 perfect spot-kick record for Chelsea. With Palmer's penalties having come in the league, it also set a new Premier League best, surpassing Yaya Toure's 11 out of 11." },
            { "type": "img", "src": "image/cole_2425_4.png", "title": "Palmer scored from the spot at Spurs for the second season in a row", "desc": "" },
            { "type": "p", "text": "With a goal against Fulham on Boxing Day, Palmer took his 2024 Premier League tally to 26, the most scored by a Chelsea player in a calendar year in the competition. Adding on his 13 assists he also set a new Chelsea record for Premier League goal involvements in a year." },
            { "type": "p", "text": "That Fulham strike won him yet another Chelsea Goal of the Month award." },
            { "type": "img", "src": "image/cole_2425_5.png", "title": "Palmer brilliance wins Goal of the Month again!", "desc": "Watch Cole Palmer's excellent run and finish against Fulham at Stamford Bridge, which has won Goal of the Month for December..." },
            { "type": "p", "text": "Two more goals followed in consecutive Premier League fixtures against Crystal Palace and Bournemouth before a rare spell without finding the net. That might have ended when a penalty was awarded against Leicester in early March but for the first time in his Chelsea career Palmer did not convert it, meaning he remained tied with Hasselbaink for the best run of successful spot-kicks scored. The Blues went on to win the game." },
            { "type": "p", "text": "Palmer did end his run without a goal by successfully dispatching a penalty. That was late on in a 3-1 win over Liverpool at the Bridge in May. It was his first goal since mid-January and capped an all-round good display." },
            { "type": "p", "text": "That was followed by the UEFA Conference League final in Poland and no player did more to turn a 1-0 deficit against Real Betis into victory. Two pieces of fine skill created the first two Chelsea goals in the eventual 4-1 victory." },
            { "type": "p", "text": "He finished the season prior to the Club World Cup as Chelsea top scorer again with 15 strikes." }
          ]
        },
        {
          "title": "Pre-Chelsea",
          "content": [
            { "type": "p", "text": "Palmer joined Manchester City’s academy at Under-8 level and moved through the youth ranks at the club. He captained City’s Under-18s during the 2019/20 season and helped the side win the FA Youth Cup, scoring in the final against Chelsea. " },
            { "type": "p", "text": "He was also named among the substitutes for the senior team on four occasions, including for a Premier League fixture against Chelsea at Stamford Bridge." },
            { "type": "p", "text": "Palmer's men's first-team debut arrived the following season when he started in the Carabao Cup fourth round against Burnley. His first senior goal arrived a year later when he struck against Wycombe Wanderers in the same competition. " },
            { "type": "p", "text": "In 2022/23, the 21-year-old established himself as a regular in the City squad. He made 25 appearances across all competitions and ended the campaign as a Premier League, Champions League and FA Cup winner. " },
            { "type": "p", "text": "At the start of the next season, immediately prior to his move to Chelsea, he scored in both the Community Shield and UEFA Super Cup." }
          ]
        },
        {
          "title": "International Career",
          "content": [
            { "type": "p", "text": "Having represented England through the junior age groups and played at the European Under-17 Championships, Palmer was part of the side (along with Levi Colwill and Noni Madueke) that won the European Under-21 Championship in the summer of 2023. " },
            { "type": "p", "text": "He scored in a 3-0 semi-final win over Israel and was in the side that beat Spain in the final." },
            { "type": "p", "text": "In September 2023, he scored a fine goal in England Under-21s win against Luxembourg and then the next month, wore the captain's armband in a 9-1 win over Serbia." },
            { "type": "p", "text": "In November of the same season, Palmer was a late call-up to the England senior squad for European Championship qualifiers against Malta and North Macedonia, reward for a fine start to his Chelsea career." },
            { "type": "p", "text": "He came on in the second half of the Malta match at Wembley to earn his first cap. England won 2-0." },
            { "type": "p", "text": "On his third appearance, against Bosnia in June 2024, he slotted his first senior international goal. Following a season in which he scored nine out of nine penalties for Chelsea, it came from the spot. That was in a warm-up game for Euro 2024, with Palmer named in the squad for the tournament in Germany." },
            { "type": "img", "src": "image/cole_inter_1.png", "title": "Cole made his England senior team debut against Malta in November 2023", "desc": "" },
            { "type": "p", "text": "Having remained on the bench for the first two group-stage games, Palmer came on in all the matches that followed as England made the final and he had a big impact late in the tournament." },
            { "type": "p", "text": "He converted a penalty when the quarter-final against Switzerland went to a shoot-out and he provided an incisive pass for Ollie Watkins to score a late winner against the Netherlands in the next match." },
            { "type": "p", "text": "With England 1-0 down versus Spain in Berlin, Palmer supplied the type of goal Chelsea fans had enjoyed all season to level the scores in the final, although he would ultimately be on the losing side." },
            { "type": "img", "src": "image/cole_inter_2.png", "title": "Cole Palmer's goal in the Euro 2024 final", "desc": "" },
            { "type": "p", "text": "In October 2024, Palmer was announced as the winner of a supporters' vote for the 2023/24 England Men’s Player of the Year award. He finished ahead of Real Madrid's Jude Bellingham and Arsenal's Bukayo Saka in the poll." }
          ]
        }
      ]
    },
    "pedro_neto": {
      "joined": "Portugal international Pedro Neto moved from Wolverhampton Wanderers to Chelsea on 11 August 2024. He signed a seven-year contract.",
      "paragraphs": [
        "A swift winger with dribbling ability and a sharp change of direction, though predominately left-footed, he can operate on either flank."
      ],
      "mainImage": "image/neto_main.png",
      "image": "image/neto_info.png",
      "shirtNum" : "7",
      "accordion": [
        {
          "title": "2024/25",
          "content": [
            { "type": "p", "text": "A week after signing, Neto played in his first Chelsea game when he came on during the second half of a home match against Manchester City."},
            { "type": "p", "text": "His first start was the following game, against Servette in the UEFA Conference League with his full Premier League debut four matches into the season at home to Crystal Palace."},
            { "type": "p", "text": "Against Barrow at Stamford Bridge in the first Carabao Cup game of the season, Neto scored his first Chelsea goal, the team's fourth in a 5-0 win. That was soon followed by a powerful finish for a goal against Gent in the UEFA Conference League."},
            { "type": "p", "text": "One of very few players to feature significantly in the Premier League and Conference League campaign in the first half of the season, a highlight of his early months at Chelsea was his equaliser at home to Arsenal. Coming in on a run from the right and outside the penalty area, he unleashed a rocket into the bottom corner of the Gunners’ net."},
            { "type": "img", "src": "image/neto_2425_1.png", "title": "Neto celebrates his equaliser against Arsenal, his first Premier League goal for the Blues", "desc": ""},
            { "type": "p", "text": "In February 2025 came another goal in a London derby, this time the opener in a home win over West Ham. That was again when deployed as a winger, however, his next goal came during a spell as the most central striker while Nicolas Jackson was out injured."},
            { "type": "p", "text": "This strike, which won Chelsea Goal of the Month for February, was against Southampton and a Neto free-kick in the same match was headed in by Levi Colwill."},
            { "type": "img", "src": "image/neto_2425_2.png", "title": "NETO WINS FEBRUARY GOTM! 💥", "desc": "Re-watch Pedro Neto's power shot during Chelsea's 4-0 Premier League win against Southampton at Stamford Bridge..."},
            { "type": "p", "text": "His next goal was even better. Chelsea had been losing late on in a west London derby at Fulham but Neto completed a turnaround with an explosive shot on the turn for a 2-1 win. It was a first away win for four months and a big boost to the Champions League qualification quest. The goal was voted Chelsea's best men's goal of the season."},
            { "type": "img", "src": "image/neto_2425_3.png", "title": "Palmer’s first season in blue 🚀 2023/24", "desc": "46 appearances, 25 goals, 15 assists and six end-of-season awards, including Chelsea's Player of the Season. What a year, Cole!"},
            { "type": "p", "text": "Before the end of the campaign came assists against Liverpool and Nottingham Forest, the latter for the goal that sealed our Champions League spot."},
            { "type": "p", "text": "Neto was handed a start in the UEFA Conference League final and ended his first Chelsea season prior to the Club World Cup with six goals and six assists from his 45 games."},
            { "type": "p", "text": "He then scored in both of the team's opening two games at the Club World Cup."}
          ]
        },
        {
          "title": "Pre-Chelsea",
          "content": [
            { "type": "p", "text": "Neto started his career in the youth system of Braga in his homeland. His talent began to shine when he made his men's first-team debut in May 2017 and scored in a 4-0 victory over Nacional. At 17 years, two months and five days, he became the third-youngest scorer in the club’s history."},
            { "type": "p", "text": "A two-year loan move to Italy with Lazio followed, during which he time he won the Coppa Italia. That switch was made permanent ahead of the 2018/19 campaign."},
            { "type": "p", "text": "Neto then moved to the Premier League when he transferred to Wolves in August 2019. He scored and created a goal on his debut – a 4–0 win over Pyunik in the third qualifying round of the UEFA Europa League – and quickly established himself as a regular in the Wolves attack."},
            { "type": "p", "text": "He went on to make 135 appearances for the club and in his last season there before his move to Chelsea he contributed to 11 goals in 20 Premier League appearances."}
          ]
        },
        {
          "title": "International Career",
          "content": [
            { "type": "p", "text": "Neto played through the age groups for Portugal and made his senior debut in November 2020 and scored, in a 7-0 friendly win against Andorra."},
            { "type": "p", "text": "Though injury kept him out of Euro 2020 the following summer and the 2022 World Cup, immediately prior to his move to Chelsea he featured in all of Portugal’s Euro 2024 group games, two of them from the bench. He set up a late winning goal for Francisco Conceicao in the opener but remained an unused substitute for the two knockout matches."},
            { "type": "p", "text": "Having become a Blue, Neto’s second international goal came in November 2024 in a Nations League win over Poland."},
            { "type": "img", "src": "image/neto_inter_1.png", "title": "Neto nets for Portugal", "desc": ""},
            { "type": "p", "text": "In June 2025, he played a part in Portugal winning that tournament. Having featured in a semi-final win over Germany, Neto provided an assist for one of the goals in the final against Spain. Having ended 2-2 in open play, a penalty shoot-out settled it in Portugal's favour."}
          ]
        }
      ]
    },
    "enzo_fernandez": {
      "joined": "Enzo Fernandez joined Chelsea from Benfica at the end of the January transfer window in 2023, signing a contract with the Blues until 2031.",
      "paragraphs": [
        "That was shortly after he had become a World Cup winner with Argentina in Qatar, having also caught the eye with a string of impressive performances for Benfica during his debut campaign in Europe. Fernandez was initially a defensive-minded player, but possesses the technical ability to operate as a playmaker and the athleticism to support attacks and go box-to-box, becoming regarded as a complete midfielder."
      ],
      "mainImage": "image/enzo_main.png",
      "image": "image/enzo_info.png",
      "shirtNum" : "8",
      "accordion": [
        {
          "title": "2022/23",
          "content": [
            { "type": "p", "text": "Having been signed just as the transfer window closed in January 2023, Enzo was handed his first Chelsea start at the earliest opportunity, at home to Fulham in a scoreless draw."},
            { "type": "p", "text": "He impressed instantly with the range and quality of his passing and for the rest of the season he was a fixture in the team, named in the starting line-up for every one of the games."},
            { "type": "p", "text": "In his second appearance, at West Ham, he played an outstanding, lifted pass for Joao Felix to score and he made another assist in similar style in a win at Leicester, this time for a Kai Havertz goal."},
            { "type": "img", "src": "image/enzo_2223_1.png", "title": "Enzo Fernandez taking on Liverpool for the first time", "desc": ""},
            { "type": "p", "text": "Caretaker manager towards the end of the season, Frank Lampard, confirmed he believes Enzo has the attributes to play a more attacking role but the balance of the squad was the reason why he selected him deeper in the midfield."}
          ]
        },
        {
          "title": "2023/24",
          "content": [
            { "type": "p", "text": "Only five people played more minutes for Chelsea in 2023/24 than Enzo. Frequently chosen in central midfield with Moises Caicedo, the Ecuadorian’s arrival allowed Enzo to advance more than in the previous season and he was able to score his first goal for the club."},
            { "type": "p", "text": "That came in the first cup game of the season, a shot from distance into the bottom corner that proved to be a winner against AFC Wimbledon."},
            { "type": "img", "src": "image/enzo_2324_1.png", "title": "Enzo guides in his goal against Wimbledon in the Carabao Cup", "desc": ""},
            { "type": "p", "text": "He followed it up with six more, including in December two of the goals against Brighton in a 3-2 victory – a headed opener and a penalty to win the match. He had seen an earlier penalty saved at West Ham."},
            { "type": "p", "text": "Without doubt his most outstanding strike was a brilliant free-kick fired past his Argentina team-mate Emiliano Martinez in an FA Cup replay at Aston Villa. He was named Player of the Match. In the next round against Leeds, Enzo captained the side for the first time and between those cup-ties he made it two goals in two games when following up his Villa Park one with the third in a 3-1 win at Crystal Palace as Chelsea finished the game with a late flourish."},
            { "type": "img", "src": "image/enzo_2324_2.png", "title": "Enzo's spectacular free-kick wins GOTM! 🚀", "desc": "Watch Enzo Fernandez's special free-kick against Aston Villa in the FA Cup at Villa Park..."},
            { "type": "p", "text": "Enzo appeared at Wembley for the first time when he played all 120 minutes of the Carabao Cup final against Liverpool, having scored in the semi against Middlesbrough, and towards the end of his season, he became a provider for Cole Palmer."},
            { "type": "p", "text": "After his pass had led to a goal against Newcastle, it was Enzo’s short corner that picked out Palmer for the hugely dramatic last-gasp winner in a late 4-3 turnaround against Manchester United."},
            { "type": "p", "text": "He missed the final six matches of the season following surgery on a groin problem that had been troubling him."}
          ]
        },
        {
          "title": "2024/25",
          "content": [
            { "type": "p", "text": "With club captain Reece James unavailable, Enzo was handed the skipper's armband for the first game of the season. He was also given an attacking midfield role although played deeper when the formation changed in later games."},
            { "type": "p", "text": "His excellent pass to Noni Madueke led to a goal in the first European game of the season, at home to Servette. There would follow a hat-trick of assists in the same competition in an 8-0 win over Noah."},
            { "type": "p", "text": "As the season progressed, Enzo continued to captain the side and vary his midfield position, in part dependent on the availability of Romeo Lavia to play deeper with Moises Caicedo."},
            { "type": "p", "text": "A good run of form for Enzo included three goals in four games - all victories - including what proved to be a winner at Leicester and an important strike in a fightback at Tottenham. During a good autumn run of results for the team there were also regular assists."},
            { "type": "img", "src": "image/enzo_2425_1.png", "title": "Enzo finding the net in a 4-3 win at Spurs", "desc": ""},
            { "type": "p", "text": "Into 2025, results dipped but Enzo continued to be a regular in varying midfield positions, while Reece James returned to his captaincy role. Enzo opened the scoring at Aston Villa although that game was lost but he did find the net in a win in Copenhagen as Chelsea continued our progress in the Conference League."},
            { "type": "p", "text": "As April began, during one of his best performances in a Chelsea shirt, he headed in a Cole Palmer cross for the only goal of the game at home to Tottenham to make it goals scored home and away against the north Londoners."},
            { "type": "img", "src": "image/enzo_2425_2.png", "title": "Enzo Fernandez was named Player of the Match after this home win versus Spurs", "desc": ""},
            { "type": "p", "text": "In the next home game, a Premier League meeting with Ipswich Town, Enzo played his 100th Chelsea game and before the end of the season he finished strongly, he netted an early goal in a win against freshly crowned champions Liverpool and then scored the vital equaliser in the UEFA Conference League final. He also supplied an assist in that triumph over Real Betis."}
          ]
        },
        {
          "title": "Pre-Chelsea",
          "content": [
            { "type": "p", "text": "Born in San Martin on the outskirts of Buenos Aires in January 2001, Enzo Fernandez joined River Plate aged just five, having stood out playing for his local team Club La Recova."},
            { "type": "p", "text": "Fernandez progressed through River’s fabled academy system and was called up to the reserve squad early in 2019. He soon played his first game at that level, and within days took another significant step in his fledgling senior career, making River’s first-team bench for their defeat to Patronato barely a week after his 18th birthday. River manager Marcelo Gallardo carefully managed his development and waited until March 2020 before handing him his River debut in a Copa Libertadores defeat to LDU Quito."},
            { "type": "img", "src": "image/enzo_pre_1.png", "title": "Enzo and Crespo celebrate a Defensa y Justicia goal", "desc": ""},
            { "type": "p", "text": "Soon after, Gallardo advised Fernandez to go out on loan to gain experience. He duly joined Hernan Crespo’s Defensa y Justicia. Fernandez quickly earned his place in the starting XI at one of Buenos Aires' smaller top-flight clubs, showcasing his technical ability under the management of former Chelsea striker Hernan Crespo."},
            { "type": "p", "text": "Fernandez and the Hawks’ star burned brightest in the Copa Sudamericana, South America’s equivalent of the Europa League. He started both legs of a 4-2 aggregate semi-final success over Chile’s Coquimbo Unido in January 2021, and then shone in the final against Argentinean rivals Lanus. Defensa y Justicia won 3-0, securing their first honour in a generation, and first ever in continental competition."},
            { "type": "img", "src": "image/enzo_pre_2.png", "title": "Fernandez kisses the Recopa Sudamericana", "desc": ""},
            { "type": "p", "text": "A second international triumph swiftly followed. Fernandez played throughout both legs of the Recopa Sudamericana, CONMEBOL’s answer to the UEFA Super Cup. Against Copa Libertadores champions Palmeiras, Fernandez more than held his own as Defensa y Justicia overturned a 3-1 aggregate deficit to take the showpiece to penalties. Fernandez made no mistake with his."},
            { "type": "p", "text": "Fernandez’s performances had caught the eye and Gallardo ended his loan, which was due to run until December 2021, early. He returned to River, who were flying high in the table, in July, and went straight into their starting XI."},
            { "type": "p", "text": "Fernandez scored his first goal for his boyhood club against Velez Sarsfield in August 2021, providing an assist in the same game. River won the league title with three games to spare, with Fernandez featuring 15 times in all. He had his third winners’ medal in the same calendar year."},
            { "type": "img", "src": "image/enzo_pre_3.png", "title": "Scoring for River against Defensa in late 2021", "desc": ""},
            { "type": "p", "text": "In the first half of 2022 his game reached a new level. Fernandez scored 10 goals and registered six assists in 26 appearances for River Plate in league and cup. Unsurprisingly, his performances did not go unnoticed in Europe, and in the summer he joined Benfica, a club renowned for importing South American starlets."},
            { "type": "p", "text": "Fernandez took no time adapting to his new surroundings in Portugal. So impressive were his performances he was named the Liga Nos' best midfielder in August, October and November."},
            { "type": "img", "src": "image/enzo_pre_4.png", "title": "Celebrating a Champions League goal he scored for Benfica", "desc": ""},
            { "type": "p", "text": "Prior to his move to Chelsea in January, Fernandez played 29 times for Benfica in 2022/23, scoring four goals and laying on seven more as the Eagles went undefeated in the league and Europe, leaving them first in the Liga Nos table and into the knockout stages of the Champions League after topping a group containing Paris Saint-Germain and Juventus."}
          ]
        },
        {
          "title": "International Career",
          "content": [
            { "type": "p", "text": "Having previously made two appearances at Under-20 level in 2019, Enzo Fernandez was called up by Argentina manager Lionel Scaloni for a pair of friendlies in September 2022. He came off the bench in wins against Honduras and Jamaica to earn his first two caps for his country, propelling him into their squad for the World Cup two months later."},
            { "type": "p", "text": "It was Enzo’s introduction off the bench in Argentina’s second game in Qatar, against Mexico, that helped spring them into life following a shock reverse to Saudi Arabia. He whipped in a superb goal on the angle after dummying past his defender to put the seal on a 2-0 win from which Scaloni’s side never looked back."},
            { "type": "img", "src": "image/enzo_inter_1.png", "title": "Enzo scores brilliantly against Mexico", "desc": ""},
            { "type": "p", "text": "Enzo started the next game, setting up a goal for Julian Alvarez as Argentina beat Poland, and he didn’t miss a minute of their stunning knockout campaign. Positioned at the base of Argentina’s midfield trio, Enzo's tactical acumen, endless energy and technical proficiency was not only crucial in La Albiceleste’s first glory on the global stage since 1986; it also won him the FIFA Young Player Award."},
            { "type": "p", "text": "He continued to be a regular choice for his nation, missing just one game, as they won 19 of their 20 matches after the World Cup, leading up to the Copa America in the summer of 2024. A substitute appearance in a warm-up friendly in the June marked his return after groin surgery that had cut short his Chelsea season, and he made his first start in the final friendly game ahead of the tournament, a win over Guatemala."},
            { "type": "p", "text": "At the Copa America he played the second two group games and the quarter-final which his side won on penalties. In the semi-final victory over Canada, it was an Enzo shot that was deflected in by Lionel Messi in a 2-0 win."},
            { "type": "p", "text": "He started the final, as Moises Caceido and Colombia were defeated to crown Argentina as South American champions."},
            { "type": "img", "src": "image/enzo_inter_2.png", "title": "Argentina lift the trophy in Miami", "desc": ""},
            { "type": "p", "text": "In March 2025, Enzo played and scored in an emphatic win for Argentina over their big rivals Brazil. His was the second goal and he assisted for the third in a 4-1 win on the day they were assured qualification to the next year's World Cup."}
          ]
        }
      ]
    },
    "levi_colwill": {
      "joined": "Levi Colwill has been registered with us since the Under-9 age group after signing through our development centre programme.",
      "paragraphs": [
        "An England international who plays mostly at centre-back, he can also slot in on the left as a full-back or wing-back, and enjoys stepping forward as a ball-playing defender."
      ],
      "mainImage": "image/levi_main.png",
      "image": "image/levi_info.png",
      "shirtNum" : "6",
      "accordion": [
        {
          "title": "2023/24",
          "content": [
            { "type": "p", "text": "Having been part of the men's first team pre-season tour to the United States, it was announced at the start of August 2024 that Colwill had signed a new six-year contract, with an option for a further year, for a total of seven years."},
            { "type": "p", "text": "He made his debut when he began the first game of the season, at home to Liverpool. At the start of December 2023, Colwill scored his first Chelsea goal, and his first in the Premier League, from a corner in a home win against the club where he had previously been on loan - Brighton."},
            { "type": "img", "src": "image/levi_2324_1.png", "title": "Colwill scores his first goal for Chelsea against Brighton", "desc": ""},
            { "type": "p", "text": "In the following game, away at Manchester United, with Reece James beginning the game on the bench and Conor Gallagher suspended, Colwill was named as the team's captain for the first time."},
            { "type": "p", "text": "That was during a period playing at left-back. After a short spell out with injury early in 2024, he returned to centre-back, including for all 120 minutes of the Carabao Cup final against Liverpool."},
            { "type": "p", "text": "Then a longer-term injury rendered Colwill unavailable for most of March and April, and when fit again in May he was an unused substitute. His breakthrough season at Chelsea had yielded 27 starts and five sub appearances."}
          ]
        },
        {
          "title": "2024/25",
          "content": [
            { "type": "p", "text": "New head coach Enzo Maresca selected Levi Colwill in central defence for every Premier League match in the early months of the season. By the halfway stage of the campaign he had played every minute of every league game bar a match at Southampton when he was one seven changes made as rests were given."},
            { "type": "p", "text": "His centre-back partner had primarily been Wesley Fofana until the Frenchman suffered a mid-season injury. Then it was Tosin Adarabioyo."},
            { "type": "p", "text": "In the final game of 2024, away at Ipswich, Colwill made his 50th appearance for Chelsea."},
            { "type": "p", "text": "He continued to be a first choice at centre-back in the Premier League into 2025 and at the end of February he headed his first goal of the season, in a big home win over Southampton.l"},
            { "type": "img", "src": "image/levi_2425_1.png", "title": "Levi Colwill scoring the second goal of his Chelsea career - against Southampton", "desc": ""},
            { "type": "p", "text": "It was Colwill who, on the final day of the league season, scored the vital winner from close range against Nottingham Forest that secured a top-four finish."},
            { "type": "p", "text": "He followed that up by coming on for Benoit Badiashile in the second half of the UEFA Conference League final victory in Poland, shortly before Enzo Fernandez's equaliser."}
          ]
        },
        {
          "title": "Academy",
          "content": [
            { "type": "p", "text": "Colwill featured mostly for the Under-18s during 2019/20 and made his Under-19s debut in a UEFA Youth League draw with Valencia, as well as appearing in the FA Youth Cup for the first time during a 5-0 win over Bradford City."},
            { "type": "img", "src": "image/levi_aca_1.png", "title": "Colwill scores his first goal for Chelsea against Brighton", "desc": ""},
            { "type": "p", "text": "Following impressive performances for those age groups, the defender began to make appearances for the development squad side in early 2020, the first coming in a 2-2 draw with Everton. Unfortunately his season ended early after picking up a knee injury in a Youth Cup win over Millwall at Stamford Bridge. In total he made 22 outings for our Academy teams in 2019/20."},
            { "type": "p", "text": "A solid first season in full-time football meant Colwill signed his first professional contract at the club on his 17th birthday in February 2020."},
            { "type": "p", "text": "After recovering from the injury at the end of the previous season, Colwill returned to the pitch at the start of the 2020/21 season with Andy Myers' development squad and by the end of the season, only two players had started more games in the PL2 competition than his 17, as Chelsea finished runners-up."}
          ]
        },
        {
          "title": "On loan",
          "content": [
            { "type": "p", "text": "In June 2021, Colwill signed a new four-year Chelsea contract and it was announced he would have his first taste of senior football on loan at Huddersfield Town. It was ultimately a successful year, as he made 29 league appearances, mostly at centre-back, despite his season being interrupted by injury and Covid, helping a side who had ended the previous campaign in 20th to a third-place finish in the Championship."},
            { "type": "p", "text": "However, it finished in painful style, when he got the last touch on a cross destined for his own net as Huddersfield's promotion chances were ended by a 1-0 defeat in the play-off final."},
            { "type": "p", "text": "Having spent the 2022 pre-season with Thomas Tuchel's squad (although injury did limit his playing time), he moved on loan to Brighton on the eve of the new Premier League season."},
            { "type": "p", "text": "His time on the South Coast was considered a success as Brighton finished sixth in the Premier League and qualified for the Europa League. Colwill made 23 appearances in all competitions."}
          ]
        },
        {
          "title": "International Career",
          "content": [
            { "type": "p", "text": "Having represented England from schoolboy age group upwards, Colwill made his England senior debut in October 2023. Following his good start to the club season with Chelsea, when he was a regular in the side, he earned his first England cap in a friendly win over Australia at Wembley. He played the full game at left-back."},
            { "type": "p", "text": "Previously, Colwill had made his England Under-21 debut in March 2022 in a win over Andorra."},
            { "type": "p", "text": "In the summer of 2023, he was a mainstay of the Young Lions side that won the European Under-21 Championship for the first time in nearly 40 years. He played all but the last group game and in the final against Spain he put in an accomplished all-round display, including joining in with attacks. He headed against the post shortly before his team scored the only goal."},
            { "type": "p", "text": "Colwill and the defence kept a clean sheet in every game."},
            { "type": "img", "src": "image/levi_inter_1.png", "title": "Levi Colwill makes an important block in the Euro U21 final", "desc": ""},
            { "type": "p", "text": "Just prior to that tournament, he travelled with the senior England squad to a Euro 2024 qualifier."},
            { "type": "p", "text": "His first formal call-up to an England squad came at the end of August 2023, shortly after his Chelsea debut."},
            { "type": "p", "text": "On 13 October 2023 Colwill made his Three Lions bow, playing 90 minutes at left-back in a win over Australia at Wembley."},
            { "type": "img", "src": "image/levi_inter_2.png", "title": "Levi made his England debut in October 2023", "desc": ""},
            { "type": "p", "text": "He was not selected for the squad for Euro 2024 but a year after his debut while winning his fourth cap, he made an amazing goal-line clearance at Wembley, albeit in an eventual loss to Greece."},
            { "type": "img", "src": "image/levi_inter_3.png", "title": "Colwill spectacularly clears the ball", "desc": ""}
          ]
        }
      ]
    },
    "reece_james": {
    "joined": "A right-footed player, Reece James's athleticism and excellent crossing ability have helped him excel at full-back and wing-back, all the way through our Academy sides and now with the men's first team.",
    "paragraphs": [
      "Also capable of playing in a back-three or midfield, James is a graduate of our development centre programme and has been training with us since the age of six."
    ],
    "mainImage": "image/reece_main.png",
    "image": "image/reece_info.png",
    "shirtNum" : "24",
    "accordion": [
      {
        "title": "2019/20",
        "content": [
          { "type": "p", "text": "James suffered an ankle injury on international duty over the summer of 2018, so had to wait until late September before making his Blues bow. He marked the occasion with a goal, too, superbly curling a 20-yarder in against Grimsby in a big Carabao Cup win."},
          { "type": "p", "text": "A week later he started in the Champions League as we defeated Lille in France, showing no signs of nerves on such a big stage, and demonstrating his attacking talents on the right as a wing-back."},
          { "type": "img", "src": "image/reece_1920_1.png", "title": "", "desc": ""},
          { "type": "p", "text": "The landmarks kept coming. He made his Premier League debut off the bench against Newcastle United, and his first start in the competition as we beat Crystal Palace 2-0, with James earning plaudits for the manner in which he kept Wilfried Zaha quiet, this time as a right-back."},
          { "type": "p", "text": "Between those two games he scored a dramatic equaliser against Ajax (above), capping an incredible comeback from 4-1 down in 35 minutes after coming on at half-time, becoming Chelsea’s youngest-ever scorer in the Champions League and sparking delirium inside the Bridge."},
          { "type": "p", "text": "James’ versatility on the right was an important asset for Lampard throughout the season, being utilised at full-back or wing-back, although he was also used in a back-three on occasion and came on for Mason Mount in midfield during the 4-0 victory over Everton in March."},
          { "type": "p", "text": "His maturity and the trust he had earned by the end of the campaign was demonstrated when played the full 90 minutes in both the FA Cup semi-final and final, as well as the second leg of the Champions League tie away at Bayern Munich."}
        ]
      },
      {
        "title": "2020/21",
        "content": [
          { "type": "p", "text": "The right-back couldn’t have wished for a better start to the 2020/21 season, hammering home a stunning strike as we defeated Brighton 3-1 at the Amex Stadium on opening day."},
          { "type": "p", "text": "His goal came after Leandro Trossard had cancelled out Jorginho’s opener, before Kurt Zouma added a third for the Blues to ensure we left the south coast with all three points. The defender was the deliverer of the corner that led to Zouma’s goal."},
          { "type": "img", "src": "image/reece_2021_1.png", "title": "", "desc": ""},
          { "type": "p", "text": "That would be Reece’s only Premier League goal of the campaign, but what a strike it was!"},
          { "type": "p", "text": "Reece quickly established himself as Chelsea’s first-choice right-back under Frank Lampard at the start of the season, keeping the more experienced Cesar Azpilicueta out of the side to begin with. The arrival of Thomas Tuchel saw the skipper return to the side with more regularity but that wasn’t necessarily at the expense of James. Our German head coach’s preference for a three at the back with wing-backs allowed for Azpi and James to co-exist at right central defender and right wing-back respectively on many occasions."},
          { "type": "p", "text": "James even featured as the right centre-back on occasions too. Tuchel picked him in that role when we played against Leicester in both the Premier League and the FA Cup final, with the German pinpointing the defender’s pace and power as a way to combat Jamie Vardy in the Foxes frontline. While you’re most likely to see Reece line-up at right-back, the England international also showed his versatility by moving into central midfield on occasions to help see games out."},
          { "type": "p", "text": "Without question, the highlight of James – and Chelsea’s – season came in the sunshine of Porto at the end of May. The defender was a key component of the Blues side that defeated Manchester City 1-0 to win the Champions League for the second time in our history. James played the entire 90 minutes at right wing-back and was praised for the way he limited the threat of City’s Raheem Sterling, with the England winger unable to get the better of James and cutting a frustrated figure throughout."}
        ]
      },
      {
        "title": "2021/22",
        "content": [
          { "type": "p", "text": "For Reece James, the 2021/22 season can be viewed as one of high achievement interrupted midway through by a muscle injury serious enough to keep him from the pitch for a combined 12 whole weeks."},
          { "type": "p", "text": "Even with the injury, James was only one short of 40 appearances for the season, and his six goals placed him as our eighth top scorer. In fact it goes further than that. During their pomp in the autumn part of the season, James and his fellow wing-back on the opposite flank, Ben Chilwell, were one of the team’s principle attacking threats, given licence by Thomas Tuchel to not only run forward but also to enter the penalty area regularly – adding to the attacking numbers there as an often unpicked-up threat."},
          { "type": "p", "text": "Also like Chilwell, James did not begin the season as a starter having returned from his summer break later than most due to his presence in the England squad for the Euros, but after the Super Cup and the Premier League opener, by the third game he was back in the starting 11 and made an immediate and outstanding impact, squaring for Romelu Lukaku to score early on and then firing in the second goal of a victory at Arsenal."},
          { "type": "img", "src": "image/reece_2122_1.png", "title": "", "desc": ""},
          { "type": "p", "text": "A harsh red card for a goal-line handball at Anfield in the following game was a rare setback but despite the penalty conceded, the team left Liverpool with a draw and James was soon back winning for club and country."},
          { "type": "p", "text": "He contributed a top-quality goal to the 7-0 thrashing of Norwich and with Chilwell by now back in the side and scoring freely, the attacking weapon that was our wing-backs was now being widely noticed. Tuchel would later confirm he classed that position in this system more as a midfielder than a defender."},
          { "type": "p", "text": "James built himself a reputation in 2021/22 as not only a reliable penalty taker but one who could do so in the most pressured situations. In two rounds running of the Carabao Cup he converted the fifth and decisive spot-kick in shoot-outs against Premier League opposition, before later slotting one in the marathon at the end of the final of that competition against Liverpool. He also scored a penalty when the FA Cup final against the same team finished goalless too. Sadly at the end of each of those Wembley occasions, James received a runner-up medal."},
          { "type": "p", "text": "The threat in the attacking third of the pitch from James was no better showcased than during our trip to Newcastle in October. Having been frustrated by defensive opponents for over an hour, the England international cracked in a left-foot shot to break the deadlock and followed it soon after with one from his right foot to set us on the way to a 3-0 win. For a period he was our Premier League top scorer."},
          { "type": "img", "src": "image/reece_2122_2.png", "title": "James nets one of his two goals at Newcastle", "desc": ""},
          { "type": "p", "text": "An assist in each of the next two games followed, including a cross for Romelu Lukaku to head home against Burnley, before one of the season highlights – a 4-0 win against Juventus at Stamford Bridge."},
          { "type": "p", "text": "With a chest down and clean strike, James was on target as for the first time in a Chelsea Champions League match, there were three different English goalscorers, and all products of our Academy (Trevoh Chalobah and Callum Hudson-Odoi were the other two). It was his one European goal in 2021/22."},
          { "type": "p", "text": "In December at West Ham, four days before his 22nd birthday, he played his 100th Chelsea game, that milestone reached just over three years after his debut."},
          { "type": "p", "text": "Chelsea had been top of the table for two months until defeat that day in the Olympic Park but now points began to slip away fairly regularly. James played the pass for Mason Mount to open the scoring at home to Everton but that ended in a draw and with Covid and other injuries (including to Chilwell) biting in midwinter, we could ill afford to lose James for any length of time."},
          { "type": "p", "text": "A serious muscle tear suffered in the last game of 2021 kept James out for two months. He then returned briefly (and scored a very skilful opener at Burnley) but needed further time out for full recovery so it was not until April that his season restarted properly started."},
          { "type": "p", "text": "By that time the team were in the Champions League quarter-finals, the FA Cup semi-finals and attempting to consolidate third position in the Premier League. On occasions James was asked to play on the right of a back-three including in the Bernabeu where Chelsea so nearly overcame a big first-leg deficit. His pace, power, and calmness in playing out from tight situations caught the eye that night in Spain and those qualities were on display for the rest of the campaign."},
          { "type": "img", "src": "image/reece_2122_3.png", "title": "A great contest between Reece James and Vinicius Junior", "desc": ""},
          { "type": "p", "text": "James provided a quality assist in each of our last three league games of the season and his final total for supplying assists was just one fewer than Mount’s 10."}
        ]
      },
      {
        "title": "2022/23",
        "content": [
          { "type": "p", "text": "Reece James's outstanding performance levels continued when the 2022/23 campaign got underway. Whether deployed at right-back or right wing-back, he remained a major threat in the final third and got off the mark for the season in the first home game, finishing emphatically past Hugo Lloris in a 2-2 draw with Tottenham."},
          { "type": "img", "src": "image/reece_2223_1.png", "title": "James celebrates his goal against Tottenham", "desc": ""},
          { "type": "p", "text": "He provided an assist for Raheem Sterling in our next home fixture, against Leicester, and marked his 100th start for the Blues in style. He produced a virtuoso performance against the Italian champions AC Milan, scoring one and setting up another as Europe again took notice of his talent."},
          { "type": "p", "text": "Sadly, in the reverse fixture the following week, James sustained a knee injury which ruled him out of the World Cup."},
          { "type": "p", "text": "He returned to action when domestic football resumed after Christmas but again had to miss a tranche of games because of a reoccurrence of his knee problem. James was fit to return against Borussia Dortmund in the Champions League, and also played the full 90 minutes of both legs of our quarter-final meeting with Real Madrid, but the feeling he was playing through the pain barrier against the European champions was supported when he missed the rest of the campaign with a hamstring injury."}
        ]
      },
      {
        "title": "2023/24",
        "content": [
          { "type": "p", "text": "Club captain James was limited to just six starts and five substitute appearances in 2023/24."},
          { "type": "p", "text": "He suffered a hamstring injury in the opening game of the season, returning in October to make his 100th Premier League appearance in a home draw against Arsenal. A run of games that included an assist for a Raheem Sterling goal in a dramatic 4-4 draw against Man City, was interrupted by a sending off for two bookable offences at Newcastle."},
          { "type": "p", "text": "Then, following further hamstring trouble that forced James off in a match at Everton in December 2023, a decision was taken to undergo surgery."},
          { "type": "p", "text": "The return from that came in style in May, when just three minutes after coming on in a game at Nottingham Forest, he crossed superbly for Nicolas Jackson to head the winner. A red card in the next game at Brighton resulted in a suspension for the final game of the season and the opening of 2024/25."},
          { "type": "img", "src": "image/reece_2324_1.png", "title": "Reece celebrating Nico's winner against Nottingham Forest", "desc": ""}
        ]
      },
      {
        "title": "2024/25",
        "content": [
          { "type": "p", "text": "Following suspension and injury at the start of the season, James made his first appearance on 20 October, playing the first 52 minutes at right-back in a game at Anfield."},
          { "type": "p", "text": "He started a win over Newcastle and a draw at Old Trafford before another spell out, making his return to playing action in the FA Cup against Morecambe. In the following game, a Premier League home match against Bournemouth, he came off the bench and drilled in a late equaliser, a free-kick expertly planted into the bottom corner. It was his first goal for over two years and was joyously celebrated by player and fans alike. It was then voted Chelsea Goal of the Month for January."},
          { "type": "img", "src": "image/reece_2425_1.png", "title": "Reece James wins January 2025 Goal of the Month!", "desc": "Watch Reece James' stunning free-kick against Bournemouth at Stamford Bridge, which has won Goal of the Month for January..."},
          { "type": "p", "text": "In February and March, Enzo Maresca began to use James in a deep midfield role. It was when playing in that position that he found the net with a low shot from outside the penalty area to open the scoring in a 2-1 win away in Copenhagen."},
          { "type": "p", "text": "In the penultimate league game of the season, back at right-back, his superb turn and cross teed up Marc Cucurella's winner at home to Manchester United - a crucial three points en route to Champions League qualification."},
          { "type": "p", "text": "In the UEFA Conference League final, he began the match on the bench but was introduced at half-time with the team trailing. He ended the night lifting a trophy for the first time as Chelsea captain."},
          { "type": "img", "src": "image/.png", "title": "", "desc": ""}
        ]
      },
      {
        "title": "Academy",
        "content": [
          { "type": "p", "text": "James started out mostly as a striker before moving further back into midfield and defence. He made his youth-team debut while still a schoolboy in 2015/16 before becoming a key figure in our Treble-winning Under-18 season the following year."},
          { "type": "p", "text": "His versatility was a key attribute as he featured at right-back, wing-back and in a central defensive back three throughout the campaign, playing in every game as the Youth Cup was successfully retained and scoring a brilliant header in the semi-final at White Hart Lane."},
          { "type": "p", "text": "In March 2017, James signed a first professional contract at the club which ran until the end of the 2018/19 campaign. He continued his good form in 2017/18, captaining the Under-18s to another FA Youth Cup triumph and being named Academy Player of the Season."}
        ]
      },
      {
        "title": "On loan",
        "content": [
          { "type": "p", "text": "In June 2018, he signed a four-year Chelsea contract and went on loan to Wigan Athletic in the Championship for the forthcoming season."},
          { "type": "p", "text": "There he was a huge success. He was instrumental in helping Wigan stay in the Championship and received an astonishing 96 per cent of the votes from Latics supporters in their Player of the Year poll."},
          { "type": "p", "text": "He played at right-back and central midfield and was also voted Wigan’s Players’ Player of the Year. To top it off he won the club’s Goal of the Season award for a brilliant hit away to Bristol City."}
        ]
      },
      {
        "title": "International Career",
        "content": [
          { "type": "p", "text": "He was a key part of the England Under-17 side that triumphed at the Toulon Tournament in the summer of 2017. There he impressed to such an extent he was named in the team of the competition. He travelled to the European Under-19 Championship the same year, before stepping up to Under-21 level in October 2019."},
          { "type": "img", "src": "image/reece_inter_1.png", "title": "", "desc": ""},
          { "type": "p", "text": "Almost exactly a year later received his first call-up to the England senior squad. His debut for the Three Lions soon followed, on 8 October 2020, when he came on as a substitute in the second half of a 3-0 win over Wales at Wembley Stadium, and he made his first start as a wing-back against Denmark in the Nations League, although he was shown a red card after the final whistle of that 1-0 defeat."},
          { "type": "p", "text": "James was named as part of Gareth Southgate's England squad for Euro 2020, making one appearance for the Three Lions as he played every minute of the 0-0 draw against Scotland in the group stage. He was an unused substitute for four of their remaining five games, including the semis and the final as they lost out to Italy on penalties at Wembley."},
          { "type": "p", "text": "He continued to feature as England qualified for the 2022 Qatar World Cup but a knee injury suffered in the prelude to that tournament ruled him out of it."},
          { "type": "p", "text": "Continuing fitness difficulties prevented his involvement in Euro 2024 as well."},
          { "type": "p", "text": "In March 2025, James made his first international start since September 2022 when he was selected for a match at Wembley against Latvia by his former head coach at Chelsea, Thomas Tuchel. Playing at right-back, he made his return in style by scoring the opener in a 3-0 win with a brilliant, curling free-kick."},
          { "type": "img", "src": "image/reece_inter_2.png", "title": "It was a special strike from Reece", "desc": ""}
        ]
      }
    ]
    },
    "joao_pedro": {
      "joined": "Joao Pedro moved from Brighton and Hove Albion to Chelsea at the start of July 2025.",
      "paragraphs": [
        "A versatile forward, he arrived with top-flight experience and had also represented Brazil on the international stage with three caps at the time of his signing for the Blues."
      ],
      "mainImage": "image/joao_main.png",
      "image": "image/joao_info.png",
      "shirtNum" : "20",
      "accordion": [
        {
          "title": "Pre-Chelsea",
          "content": [
            { "type": "p", "text": "A product of Brazilian giants Fluminense, Joao Pedro first emerged as a teenager with flair and a natural eye for goal. He netted 10 times in 36 games for the Rio club before making the leap to English football."},
            { "type": "p", "text": "His journey continued at Watford, where he impressed across four seasons with 109 appearances, 24 goals, occasionally wearing the captain’s armband during the 2022/23 campaign - all before turning 22."},
            { "type": "p", "text": "In 2023, Joao Pedro signed for Brighton and made an instant impact. He scored on his debut and went on to deliver a standout campaign with 19 goals in all competitions, finishing as the Seagulls’ joint-top scorer."},
            { "type": "p", "text": ""},
            { "type": "p", "text": ""}
          ]
        }
      ]
    },
    "wesley_fofana": {
    "joined": "Wesley Fofana moved to Chelsea from Leicester City in late August 2022, signing a seven-year contract with the Blues.",
    "paragraphs": [
      "One of the Premier League’s most highly rated young players, Fofana arrived to further bolster the defence for the 2022/23 season, following the arrivals of Kalidou Koulibaly and Marc Cucurella earlier that summer. After impressing in his homeland France with Saint-Etienne, Fofana further underlined his credentials as one of the game’s most promising all-round defenders with his performances during two seasons in England with Leicester. He was named as the Foxes’ Young Player of the Year in his debut campaign in the Premier League, 2020/21, with one of his best performances in England so far coming against Chelsea in that season’s FA Cup final, as Leicester won the trophy for the first time."
    ],
    "mainImage": "image/fofana_main.png",
    "image": "image/fofana_info.png",
    "shirtNum" : "29",
    "accordion": [
      {
        "title": "2022/23",
        "content": [
          { "type": "p", "text": "Wesley Fofana made his Chelsea debut in the 2-1 win against West Ham at the start of September, playing the full 90 in our next league outing at Crystal Palace a month later."},
          { "type": "img", "src": "image/fofana_2223_1.png", "title": "Fofana opened the scoring with a cool finish", "desc": ""},
          { "type": "p", "text": "However, his start to life at Stamford Bridge took a turn for the worse when he sustained a knee injury against AC Milan on his fourth appearance, not long after giving us the lead with his first goal for the club."},
          { "type": "p", "text": "Fofana was fit to return against Southampton in mid-February, and he would only miss three more of our fixtures from then until the end of the season. He scored his first league goal for the Blues with a header against Leeds, the winner, and he was also impressive in the Bernabeu having received a very early yellow card, playing with assurance and attacking thrust at times, too."}
        ]
      },
      {
        "title": "2023/24",
        "content": [
          { "type": "p", "text": "In July 2023, just before the pre-season tour to the United States, it was announced Fofana had undergone anterior cruciate ligament reconstruction surgery."},
          { "type": "p", "text": "The injury prevented him playing a game in the 2023/24 season."}
        ]
      },
      {
        "title": "2024/25",
        "content": [
          { "type": "p", "text": "Following his injury problems over the previous year, Fofana was able to start the first seven league games of the season, playing at right-back on one occasion at West Ham. That was until the run of games was interrupted by suspension. He missed a defeat at Anfield."},
          { "type": "img", "src": "image/fofana_2425_1.png", "title": "Fofana snuffs out a Leicester attack", "desc": ""},
          { "type": "p", "text": "However, another run followed alongside regular central defensive partner Levi Colwill as Chelsea accumulated Premier League points before, at the start of December, Fofana suffered a hamstring injury."},
          { "type": "p", "text": "He returned to play two games in March but then underwent successful hamstring surgery."}
        ]
      },
      {
        "title": "Pre Chelsea",
        "content": [
          { "type": "p", "text": "Wesley Fofana did not join a professional youth system until the age of 14, but made up for lost time by having an instant impact when given his first chance in senior football in his native France with Saint-Etienne. The 21-year-old then took to a new country just as easily when signing for Leicester City, quickly becoming one of the most exciting young defenders in the Premier League."},
          { "type": "p", "text": "Born in the footballing hotbed of Marseille on the south coast of France, Fofana started his youth career at a series of small clubs around the country, taking in spells with Repos Vitrolles, Mining Basin, Des Pennes Mirabeau and Air Bel before joining the ranks of top-flight club Saint-Etienne in 2015, aged 14."},
          { "type": "p", "text": "Initially playing for Saint-Etienne II in the fourth tier, the teenager’s breakthrough arrived in the 2018/19 season after signing his first professional contract that summer, making several appearances for the second string as well as starring for the club’s Under-19s as they won the Coupe Gambardella – France’s prestigious national youth cup."},
          { "type": "img", "src": "image/fofana_pre_1.png", "title": "Fofana made his senior debut for Saint-Etienne in 2018/19", "desc": ""},
          { "type": "p", "text": "He was rewarded with a debut for the first team in Ligue 1, although it arrived earlier than expected. Having been an unused substitute in Saint-Etienne’s previous two games, an injury to Pierre-Yves Polomat 20 minutes into their crucial penultimate fixture saw Fofana come on for his top-flight debut. He contributed to a clean sheet in a 3-0 victory over Nice, which sealed their fourth-place finish in the table and European qualification. He then made his first start in their last game of the season, a 1-1 draw at Angers."},
          { "type": "p", "text": "Fofana was included in Saint-Etienne’s senior squad for 2019/20, but with many of their stars departing it turned out to be a much tougher season for the club. That was not helped by a badly timed knee injury which meant Fofana missed the opening two months of the campaign, but he was instantly propelled into the starting line-up on his return to help them retain their top-flight status. That included his first goal in Ligue 1, in a 4-1 win over Nice in December."},
          { "type": "img", "src": "image/fofana_pre_2.png", "title": "In action against PSG in the Coupe de France final", "desc": ""},
          { "type": "p", "text": "He scored again as Saint-Etienne opened their Coupe de France campaign with victory at Bastia-Borgo and started all but one of their games en route to the final. Despite a 1-0 defeat in the decider at the Stade de France, Fofana put in an impressive performance belying his years, up against a star-studded Paris Saint-Germain attack which included Kylian Mbappe and Neymar, despite his central defensive partner Loic Perrin being sent off after half-an-hour."},
          { "type": "p", "text": "The centre-back started Saint-Etienne’s first three games of 2020/21, winning all three without conceding a goal, before moving to Leicester City. The speed with which he adapted to his new surroundings and the intensity of the Premier League was even more impressive, though, as he instantly became a key player at the King Power Stadium."},
          { "type": "p", "text": "He made 38 appearances for the Foxes in his debut campaign on these shores, 28 of them in the Premier League, all but one of which came from the start, with the level of his performances seeing him named the club’s Young Player of the Season."},
          { "type": "img", "src": "image/fofana_pre_3.png", "title": "Celebrating Leicester's FA Cup final win over Chelsea", "desc": ""},
          { "type": "p", "text": "Arguably his best game of his first year in England is one Chelsea supporters will remember well, if not fondly, as he was part of the Leicester defence which managed to hold on and frustrate the Blues at Wembley when Leicester beat us 1-0 to win the FA Cup final, allowing the Foxes to lift the trophy for the first time in their history."},
          { "type": "p", "text": "It appeared his progress would be halted by serious injury, though, when Fofana suffered a broken leg in Leicester’s pre-season friendly against Villarreal shortly before the start of 2021/22. However, following his recovery, he picked up right where he had left off, and even seemed to have stepped up to another level."},
          { "type": "p", "text": "That was underlined in the first match following his return, in the second leg of their Europa Conference League last-16 tie against Rennes in France, when he headed in the decisive goal which secured the Foxes’ progress to the next round, his first for the club. It was also acknowledged as one of the best performances of his career, despite it being his first competitive match for 10 months."},
          { "type": "img", "src": "image/fofana_pre_4.png", "title": "Scoring his first Leicester goal against Rennes in the Europa Conference League", "desc": ""},
          { "type": "p", "text": "The level of Fofana’s recovery was further shown as he featured in every minute for Leicester in all competitions for the remainder of the season, being a vital part of the team again as they reached the semi-finals of the Europa Conference League – the Foxes’ first-ever appearance in the last four of a European competition – and sparking a return to form at domestic level which saw them finish eighth in the Premier League."}
        ]
      }
    ]
    },
    "marc_cucurella": {
    "joined": "Marc Cucurella joined Chelsea on a six-year contract in August 2022.",
    "paragraphs": [
      "The versatile defender arrived just weeks after his 24th birthday following an impressive debut season in the Premier League with Brighton. A Spain international, he provided the pass for his nation's winning goal in the Euro 2024 final."
    ],
    "mainImage": "image/cucurella_main.png",
    "image": "image/cucurella_info.png",
    "shirtNum" : "3",
    "accordion": [
      {
        "title": "2022/23",
        "content": [
          { "type": "p", "text": "Marc Cucurella made his Chelsea debut as a substitute in our opening-day win at Everton, immediately impressing his new supporters with his energy and passing range."},
          { "type": "p", "text": "He started our next game, the 2-2 draw with Tottenham, delivering the corner from which fellow home debutant Kalidou Koulibaly volleyed us ahead, and it was the pull of his hair by Cristian Romero that sparked a dramatic finale to the derby."},
          { "type": "img", "src": "image/cucurella_2223_1.png", "title": "Cucurella delivers the corner for Koulibaly's opening goal", "desc": ""},
          { "type": "p", "text": "Flitting between left-back, left wing-back and the left centre-back role, Cucurella was a mainstay in our defence until the break for the World Cup. He did suffer a severe bout of tonsillitis in late September, and Graham Potter, his old boss at Brighton who by now was in charge of the Blues, explained that was one of the reasons why the Spaniard was withdrawn early in three consecutive league games in October."},
          { "type": "p", "text": "Until a muscle injury cut short his campaign in mid-April, Cucurella was a fairly regular member of Potter's Chelsea team when the domestic action resumed after Christmas. His best individual performance came in the 2-0 home win over Borussia Dortmund when he was outstanding in defence and a threat going forward."}
        ]
      },
      {
        "title": "2023/24",
        "content": [
          { "type": "p", "text": "It was a stop-start second season at Chelsea for Cucurella but one that finished strongly."},
          { "type": "p", "text": "Having been on the bench in the early weeks of Mauricio Pochettino’s time in charge, the Spaniard returned to the side at right-back initially in the absence of other options, before reverting to his more accustomed left."},
          { "type": "img", "src": "image/cucurella_2324_1.png", "title": "Cucurella in action at Villa Park", "desc": ""},
          { "type": "p", "text": "Ankle surgery wiped out the middle part of his season but he returned to score his first Chelsea goal with the opener in an FA Cup win over Leicester, and he supplied assists with crosses in Premier League victories over Everton and at his former club Brighton. He played the whole of the final 12 fixtures as the Blues secured sixth place."}
        ]
      },
      {
        "title": "2024/25",
        "content": [
          { "type": "p", "text": "Firmly established as Enzo Maresca's first choice at left-back in the Premier League, Cucurella played the first seven games of the season, often taking up an inverted role high up the pitch when the team attacked. That was until he had to serve a suspension for yellow card accumulation."},
          { "type": "p", "text": "On his return he continued to perform strongly in the team's run of wins leading up to Christmas, missing out on the draw at Everton that brought it to an end due to a red card received after the final whistle of a win over Brentford."},
          { "type": "p", "text": "Cucurella scored in consecutive games, with a close-range header in that match against Brentford and with a turn and shot against Shamrock Rovers in the Conference League. A very good save from Fulham's Bernd Leno prevented him making it three in three."},
          { "type": "img", "src": "image/cucurella_2425_1.png", "title": "Marc Cucurella slotting his goal versus Shamrock Rovers", "desc": ""},
          { "type": "p", "text": "The Spaniard continued to be the regular choice at left-back into the new year, bar one brief interruption due to suspension following a red card after the final whistle against Brentford, and the goals and assists kept coming with regularity - at home in wins against Wolves and Southampton - plus the only goal of the match in a win over Leicester at the Bridge. That low strike from the edge of the area was nominated for Premier League Goal of the Month for March."},
          { "type": "img", "src": "image/cucurella_2425_2.png", "title": "Highlights: Chelsea 1-0 Leicester", "desc": "Highlights of Chelsea's 1-0 Premier League win against Leicester City at Stamford Bridge..."},
          { "type": "p", "text": "His admirable season both defensively and contributing to the attack continued as Champions League qualification and the UEFA Conference League trophy were secured. Cucurella headed in a vital winner against Manchester United in front of joyous Matthew Harding Stand and played all 90 minutes of the European final win over Real Betis"},
          { "type": "p", "text": "Prior to the FIFA Club World Cup he was 2024/25's top appearance maker with 48 and was sixth for goals scored with seven."}
        ]
      },
      {
        "title": "Pre Chelsea",
        "content": [
          { "type": "p", "text": "In his one season at Brighton, Cucurella made 38 appearances in all competitions and scored his only goal in their penultimate home game against Manchester United."},
          { "type": "p", "text": "Such was the positive and swift nature of his adaptation to English football, playing in a variety of roles on the left-hand side including full-back, wing-back and centre-back, Cucurella was voted Player of the Season by both Brighton supporters and team-mates."},
          { "type": "p", "text": "In particular, his high-energy performances, tough tackling and marauding down the wing caught the eye, while his two-footedness and assuredness on the ball were key traits in Brighton’s possession-based approach as they secured a best ever top-flight finish of ninth. Only three players registered more than his 93 tackles in the Premier League in 2021/22."},
          { "type": "p", "text": "Prior to his switch to the South Coast, the Catalan’s footballing upbringing came in his native Spain, where he progressed through the ranks at Espanyol before joining Barcelona at the age of 14."},
          { "type": "img", "src": "image/.png", "title": "Representing Spain in the Olympic football final in 2021", "desc": ""},
          { "type": "p", "text": "He played three full seasons in La Liga, initially on loan at Eibar and Getafe, before joining the latter on a permanent basis in the summer of 2020. Much of his time in Spain was spent playing as a left midfielder before the defensive side of his game was developed under Graham Potter at the Amex Stadium."}
        ]
      },
      {
        "title": "International Career",
        "content": [
          { "type": "p", "text": "The Spaniard made his senior international debut as captain of a youthful side in the summer of 2021, in a pre-Euro 2020 friendly win over Lithuania, and picked up a silver medal at the Tokyo Olympics the following month with the Under-23 team."},
          { "type": "p", "text": "After joining Chelsea, he returned to the international side for a friendly against Brazil in March 2024 and then featured in warm-up games for Euro 2024 having been named in the squad for the tournament."},
          { "type": "p", "text": "In Germany that summer, Cucurella was one of the outstanding players as Spain progressed to lift the trophy. He started at left-back in all but the third group-stage game and was on the winning side on each occasion."},
          { "type": "img", "src": "image/cucurella_inter_1.png", "title": "Cucurella in action during the final", "desc": ""},
          { "type": "p", "text": "In the final against England, it was his low ball across that was converted in the 86th-minute by Mikel Oyarzabal to secure a 2-1 win. He was named in the team of the tournament."},
          { "type": "p", "text": "His 2024/25 season also ended in an appearance in a final - this time in Munich in the UEFA Nations League, but on this occasion Cucurella ended on the losing side when Spain lost a penalty shoot-out to Portugal."}
        ]
      }
    ]
    },
    "moises_caicedo": {
      "joined": "Chelsea completed the signing of Ecuador international Moises Caicedo from fellow Premier League side Brighton & Hove Albion in August 2023.",
      "paragraphs": [
        "The 21-year-old midfielder joined on an eight-year contract at Stamford Bridge, with a club option of a further year. A true midfield all-rounder with a wide range of skills, albeit usually operating in a deeper role shielding the defence and starting attacks, Caicedo has shown himself to be one of the Premier League and European football's most promising talents and was voted Chelsea Men's Player of the Season for 2024/25."
      ],
      "mainImage": "image/caicedo_main.png",
      "image": "image/caicedo_info.png",
      "shirtNum" : "25",
      "accordion": [
        {
          "title": "2023/24",
          "content": [
            { "type": "p", "text": "Caicedo made his Chelsea debut as a substitute in the second game of the 2023/24 season, away at West Ham United, and his first start the following game when Luton were beaten at the Bridge."},
            { "type": "p", "text": "He quickly settled into being a regular name on the team sheet and in his first season as a Blue, only Conor Gallagher played more games and more minutes. Caicedo appeared in 48 of the 51 games, starting 44 of them."},
            { "type": "p", "text": "He most frequently dovetailed with Enzo Fernandez in the centre of midfield, though taking the more holding role. His 25 defensive blocks in the Premier League were the most by any Chelsea player and he was also the second-most fouled player in the campaign."},
            { "type": "img", "src": "image/caicedo_2324_1.png", "title": "Enzo and Caicedo celebrate victory over Fulham", "desc": ""},
            { "type": "p", "text": "In a game of mixed fortunes, he provided a superb pass for a Cole Palmer goal at home to Wolves in February 2024 and later that month, he played the whole of the Carabao Cup final defeat by Liverpool."},
            { "type": "p", "text": "A further assist followed in an FA Cup win over Leeds, this time Nicolas Jackson the player supplied, and towards the end of the season and with Enzo injured, Caicedo made an impact further up the pitch as Chelsea finished the season strongly with five straight wins."},
            { "type": "p", "text": "He played a through ball for another Jackson goal against West Ham, he was named player of the match after a win at Brighton, and he saved the best to last."},
            { "type": "p", "text": "In the season’s finale at home to Bournemouth and with the Cherries’ keeper well out of his goal, Caicedo had the presence of mind and the technique to find the net from over 50 yards out – likely to be the longest-range Chelsea strike ever. It was no surprise his first goal was voted the team’s Goal of the Season."},
            { "type": "img", "src": "image/caicedo_2324_2.png", "title": "Spectacular Caicedo wins Goal of the Season!", "desc": "Watch Moises Caicedo's halfway line goal during Chelsea's 2-1 Premier League win against Bournemouth at Stamford Bridge..."}
          ]
        },
        {
          "title": "2024/25",
          "content": [
            { "type": "p", "text": "At the start of the season, under new head coach Enzo Maresca, Caicedo was handed the captain's armband for a selection of games."},
            { "type": "p", "text": "At home to Servette in the second outing of the campaign he made his 50th Chelsea appearance and in a Player of the Match performance at Old Trafford in early November, his outstanding strike earned a 1-1 draw. It was the first away goal of his career in a Premier League game and by this stage of the season he was playing regularly with Romeo Lavia in central midfield in that competition."},
            { "type": "img", "src": "image/caicedo_2425_1.png", "title": "Caicedo makes it 1-1 at Old Trafford", "desc": ""},
            { "type": "p", "text": "In 2025 and with Lavia unavailable, Enzo Fernandez played closer to the Ecuadorian until Reece James's return from injury meant another option in midfield. When Cole Palmer missed a derby match away at Arsenal in March, Caicedo became the only player to start each of our Premier League games in the season."},
            { "type": "p", "text": "His outstanding influence on the side and consistency was recognised when he won the votes for both the Chelsea Men's Player of the Season and the Chelsea Men's Players' Player of the Season, announced shortly before the end of the league season."},
            { "type": "img", "src": "image/caicedo_2425_2.png", "title": "Moi with his Player of the Season and Players' Player of the Season awards", "desc": ""},
            { "type": "p", "text": "A superb campaign, in which he was the highest appearance maker and started every league game, was capped by his icing-on-the-cake fourth goal against Real Betis in the UEFA Conference League final."}
          ]
        },
        {
          "title": "Pre Chelsea",
          "content": [
            { "type": "p", "text": "Caicedo’s journey to Chelsea started in the Ecuadorian city of Santo Domingo. By the age of 13, he was playing for a regional select XI and was in the youth ranks of CD Espoli. He joined Independiente del Valle two years later. "},
            { "type": "p", "text": "His talent was evident to all at the club and Caicedo made his senior debut at the age of 17. He established himself in the first-team squad during the 2020 campaign but also continued to represent the club in the Under-20 Copa Libertadores. "},
            { "type": "p", "text": "Caicedo played a key role in helping Independiente reach the final of the competition, where they faced off against River Plate, for whom Enzo Fernandez was in midfield. It was the Ecuadorian side that came away victorious."},
            { "type": "p", "text": "In February 2021, Caicedo left South America and completed a move to Brighton. He didn’t make his debut until the following season – an outing against Cardiff City in the EFL Cup – and then left on loan for Belgian club Beerschot."},
            { "type": "p", "text": "Caicedo spent the first half of the 2021/22 campaign in Belgium and made 14 appearances for Beerschot before being recalled by Brighton. On his return, Caicedo became a key part of the side."},
            { "type": "p", "text": "In his final season on the South Coast, Caicedo made 43 appearances for the Seagulls, who recorded their best-ever Premier League finish of sixth. Caicedo was crucial to that success and was named the club’s Player of the Season and Players' Player of the Season."}
          ]
        },
        {
          "title": "International Career",
          "content": [
            { "type": "p", "text": "Moises Caicedo began his senior international career with Ecuador in 2020, during their qualifying campaign for the 2022 World Cup. He was included from the start in a 1-0 defeat at Argentina, but things soon picked up as he retained his place for their next match to make his home debut, and marked the occasion with the opening goal as they beat Uruguay 4-2."},
            { "type": "p", "text": "Following three assists in their next two games, further qualifiers with Bolivia and Colombia, the midfielder instantly became a regular starter for his country, missing just three competitive matches up until the start of the World Cup itself more than two years later, with two of those being due to suspension."},
            { "type": "p", "text": "Caicedo played every minute of Ecuador's campaign in Qatar, impressing throughout, and briefly looked to have put them through to the knock-out stages with his equaliser against Senegal in the final group game, but the African side scored to win 2-1 and progress instead."},
            { "type": "img", "src": "image/caicedo_inter_1.png", "title": "Caicedo skips past his marker on international duty", "desc": ""},
            { "type": "p", "text": "He continued to be a regular for his nation after joining Chelsea and was selected for the squad to contest the Copa America in the summer of 2024. He reached the final in Miami but Colombia were defeated in extra-time by an Argentina side containing Enzo Fernandez."},
            { "type": "p", "text": "In September 2024 he captained his country for the first time, in an important World Cup qualifier win against Peru."}
          ]
        }
      ]
    }
}