{
  "cole_palmer": {
    "joined": "Cole Palmer joined from Manchester City on transfer deadline day in September 2023.",
    "paragraphs": [
      "A young attacking player of outstanding all-round quality who can create and score  goals, his first year at Stamford Bridge could hardly have gone better as he was awarded Player of the Season and became a full England international. In July 2024, he scored for his nation in the European Championship final versus Spain.Ahead of the start of the 2024/25 campaign, there was good news for Chelsea fans when Palmer signed a two-year contract extension, committing him to the club until 2033. Very soon after he was one of the nominees for the prestigious Ballon d’Or and he was ranked 25th for that award when the vote result was announced."
    ],
    "image": "image/cole_info.png",

    "accordion": [
      {
        "title": "2023/24",
        "content": [
          {
            "type": "p",
            "text": "Palmer made his Chelsea debut coming on as a substitute at home to Nottingham Forest, one day after his signing. His first start came in his fourth appearance, a Carabao Cup win over Brighton in which he provided the assist for the only goal, with his own first Chelsea goal coming two games later when he converted a penalty. That was in a 4-1 win at Burnley in October 2023."
          },
          {
            "type": "p",
            "text": "Having quickly become a surefire name on the team sheet and the first-choice penalty taker, Palmer's first four goals came from the spot, including a stoppage-time equaliser against his former club Man City, the day before he received his first call-up into the England senior squad. He registered four assists over the same period."
          },
          {
            "type": "img",
            "src": "image/cole_2324_1.png",
            "title": "Palmer nets his third Chelsea Penalty",
            "desc": ""
          },
          {
            "type": "p",
            "text": "Open-play goals followed during his outstanding start at his new club, and his second in a win at Luton, a marvellously adept skip past the goalkeeper and finish, was voted Chelsea's Goal of the Month for December and was nominated for the equivalent Premier League award. Palmer was also on the shortlist for the Premier League’s Player of the Month."
          },
          {
            "type": "p",
            "text": "Two goals in a big win against Middlesbrough in the semi-final second leg earned him the Carabao Cup's Player of the Round."
          },
          {
            "type": "p",
            "text": "Palmer's remarkable first Chelsea campaign accelerated still further when in March and April he scored 11 goals in just six games, including a hat-trick with two at the death against Man United to turn looming defeat into victory, and four past Everton including a first-half hat-trick. The first goal that day won a Premier League Goal of the Month award, and he was also named Premier League Player of the Season for April, the first Chelsea recipient since Eden Hazard in 2018, and the second youngest after Arjen Robben."
          },
          {
            "type": "img",
            "src": "image/cole_2324_2.png",
            "title": "Palmer wins Premier League Goal of the Month!",
            "desc": "Cole Palmer's strike against Everton has won the Premier League Goal of the Month award for April"
          },
          {
            "type": "p",
            "text": "Then following month Palmer became the first Chelsea player to reach 30 Premier League goal involvements in a season while aged 21 or younger."
          },
          {
            "type": "p",
            "text": "Honour followed honour followed honour - as at the Chelsea Annual Awards night Palmer picked up the Chelsea Player of the Year voted for by the fans, as well as the Players' Player of the Year Award. He was named the Premier League’s Young Player of the Season and the PFA Premier League Fans’ Player of the Year. He later collected the PFA Young Player of the Year for the season."
          },
          {
            "type": "p",
            "text": "By the season’s end, his 45 Chelsea games had served up 25 goals, 22 of them in the Premier League which was bettered only by Man City’s Erling Haaland with 27. His 11 assists was the second-highest tally too, behind Villa’s Ollie Watkins on 13."
          },
          {
            "type": "img",
            "src": "image/cole_2324_3.png",
            "title": "Palmer’s first season in blue 🚀 2023/24",
            "desc": "46 appearances, 25 goals, 15 assists and six end-of-season awards, including Chelsea's Player of the Season. What a year, Cole!"
          },
          {
            "type": "p",
            "text": "Palmer joined Didier Drogba and Frank Lampard to become the third Chelsea player to score 20 or more goals and provide at least 10 assists in a Premier League season, and his 25 goals across all competitions in a single season was the most by a Chelsea player since those two in the double-winning campaign of 2009/10."
          }
        ]
      },
      {
        "title": "2024/25",
        "content": [
          {
            "type": "p",
            "text": "Palmer began the new season with a two-year extension to his contract under his belt, taking him up to 2033. Meanwhile, his preceding year continued to be recognised with a ranking of 25th for Ballon d'Or and the winning of the PFA Young Player of the Year award."
          },
          {
            "type": "p",
            "text": "Typically, his first goal of the season, a precise lob in a 6-2 win at Wolverhampton Wanderers, won both the Premier League and the Chelsea goal of the month for August."
          },
          {
            "type": "img",
            "src": "image/cole_2425_1.png",
            "title": "Palmer’s genius lob vs Wolves!",
            "desc": "Re-live Cole Palmer’s exquisite lob against Wolverhampton Wanderers at Molineux…"
          },
          {
            "type": "p",
            "text": "The next month, in the next game after netting away in a win at West Ham, Palmer became the first player in Premier League history to score four times in the first half of a match only Jimmy Greaves had done so in a Chelsea game before and Palmer joined four other Blues in scoring at least four goals twice in a top-flight league game."
          },
          {
            "type": "p",
            "text": "Among his quadruple of strikes at home to Brighton was a stunning free-kick which was voted Chelsea goal of the month."
          },
          {
            "type": "p",
            "text": "With five goals and an assist in September, he was unsurprisingly named Premier League Player of the Month, a month that had begun with his 50th Chelsea appearance in a home meeting with Crystal Palace."
          },
          {
            "type": "img",
            "src": "image/cole_2425_2.png",
            "title": "Cole's super September! 🤩",
            "desc": "Re-live Cole Palmer's award-winning Player of the Month performances during September..."
          },
          {
            "type": "p",
            "text": "Another goal and another assist followed in October, as did another nomination for Player of the Month. A winner at home against Newcastle at the end of that month was voted Chelsea's best goal in October."
          },
          {
            "type": "img",
            "src": "image/cole_2425_3.png",
            "title": "Palmer wins October GOTM! 💥",
            "desc": "Re-live Cole Palmer's piledriver during Chelsea's 2-1 Premier League win against Newcastle United at Stamford Bridge..."
          },
          {
            "type": "p",
            "text": "By scoring our third goal in a 3-0 win over Aston Villa at the start of December, Palmer became the second-quickest Chelsea player to score 30 Premier League goals. It had taken him 46 games with only Jimmy Floyd Hasselbaink's 41 games proving faster. The following day he was named on the FIFPRO Men's World XI shortlist having the previous week been nominated for The Best FIFA Men's XI."
          },
          {
            "type": "p",
            "text": "That same month, in a remarkable game at Tottenham when the Blues recovered from 2-0 down to win 4-3, Palmer scored two penalties and played a major part in an Enzo Fernandez goal."
          },
          {
            "type": "p",
            "text": "The first of his penalties made it 37 Premier League goal contributions (goals or assists) in 2024, beating Hasselbaink’s club record set in 2001. The second, a coolly taken panenka perfect for his 'Cold Palmer' nickname, took him level with Hasselbaink's 12 out of 12 perfect spot-kick record for Chelsea. With Palmer's penalties having come in the league, it also set a new Premier League best, surpassing Yaya Toure's 11 out of 11."
          },
          {
            "type": "img",
            "src": "image/cole_2425_4.png",
            "title": "Palmer scored from the spot at Spurs for the second season in a row",
            "desc": ""
          },
          {
            "type": "p",
            "text": "With a goal against Fulham on Boxing Day, Palmer took his 2024 Premier League tally to 26, the most scored by a Chelsea player in a calendar year in the competition. Adding on his 13 assists he also set a new Chelsea record for Premier League goal involvements in a year."
          },    
          {
            "type": "p",
            "text": "That Fulham strike won him yet another Chelsea Goal of the Month award."
          },
          {
            "type": "img",
            "src": "image/cole_2425_5.png",
            "title": "Palmer brilliance wins Goal of the Month again!",
            "desc": "Watch Cole Palmer's excellent run and finish against Fulham at Stamford Bridge, which has won Goal of the Month for December..."
          },
          {
            "type": "p",
            "text": "Two more goals followed in consecutive Premier League fixtures against Crystal Palace and Bournemouth before a rare spell without finding the net. That might have ended when a penalty was awarded against Leicester in early March but for the first time in his Chelsea career Palmer did not convert it, meaning he remained tied with Hasselbaink for the best run of successful spot-kicks scored. The Blues went on to win the game."
          },
          {
            "type": "p",
            "text": "Palmer did end his run without a goal by successfully dispatching a penalty. That was late on in a 3-1 win over Liverpool at the Bridge in May. It was his first goal since mid-January and capped an all-round good display."
          },
          {
            "type": "p",
            "text": "That was followed by the UEFA Conference League final in Poland and no player did more to turn a 1-0 deficit against Real Betis into victory. Two pieces of fine skill created the first two Chelsea goals in the eventual 4-1 victory."
          },
          {
            "type": "p",
            "text": "He finished the season prior to the Club World Cup as Chelsea top scorer again with 15 strikes."
          }
        ]
      },
      {
        "title": "Pre-Chelsea",
        "content": [
          {
            "type": "p",
            "text": "Palmer joined Manchester City’s academy at Under-8 level and moved through the youth ranks at the club. He captained City’s Under-18s during the 2019/20 season and helped the side win the FA Youth Cup, scoring in the final against Chelsea. "
          },
          {
            "type": "p",
            "text": "He was also named among the substitutes for the senior team on four occasions, including for a Premier League fixture against Chelsea at Stamford Bridge."
          },
          {
            "type": "p",
            "text": "Palmer's men's first-team debut arrived the following season when he started in the Carabao Cup fourth round against Burnley. His first senior goal arrived a year later when he struck against Wycombe Wanderers in the same competition. "
          },
          {
            "type": "p",
            "text": "In 2022/23, the 21-year-old established himself as a regular in the City squad. He made 25 appearances across all competitions and ended the campaign as a Premier League, Champions League and FA Cup winner. "
          },
          {
            "type": "p",
            "text": "At the start of the next season, immediately prior to his move to Chelsea, he scored in both the Community Shield and UEFA Super Cup."
          }
        ]
      },
      {
        "title": "International Career",
        "content": [
          {
            "type": "p",
            "text": "Having represented England through the junior age groups and played at the European Under-17 Championships, Palmer was part of the side (along with Levi Colwill and Noni Madueke) that won the European Under-21 Championship in the summer of 2023. "
          },
          {
            "type": "p",
            "text": "He scored in a 3-0 semi-final win over Israel and was in the side that beat Spain in the final."
          },
          {
            "type": "p",
            "text": "In September 2023, he scored a fine goal in England Under-21s win against Luxembourg and then the next month, wore the captain's armband in a 9-1 win over Serbia."
          },
          {
            "type": "p",
            "text": "In November of the same season, Palmer was a late call-up to the England senior squad for European Championship qualifiers against Malta and North Macedonia, reward for a fine start to his Chelsea career."
          },
          {
            "type": "p",
            "text": "He came on in the second half of the Malta match at Wembley to earn his first cap. England won 2-0."
          },  
          {
            "type": "p",
            "text": "On his third appearance, against Bosnia in June 2024, he slotted his first senior international goal. Following a season in which he scored nine out of nine penalties for Chelsea, it came from the spot. That was in a warm-up game for Euro 2024, with Palmer named in the squad for the tournament in Germany."
          }, 
          {
            "type": "img",
            "src": "image/cole_inter_1.png",
            "title": "Cole made his England senior team debut against Malta in November 2023",
            "desc": ""
          },
          {
            "type": "p",
            "text": "Having remained on the bench for the first two group-stage games, Palmer came on in all the matches that followed as England made the final and he had a big impact late in the tournament."
          }, 
          {
            "type": "p",
            "text": "He converted a penalty when the quarter-final against Switzerland went to a shoot-out and he provided an incisive pass for Ollie Watkins to score a late winner against the Netherlands in the next match."
          }, 
          {
            "type": "p",
            "text": "With England 1-0 down versus Spain in Berlin, Palmer supplied the type of goal Chelsea fans had enjoyed all season to level the scores in the final, although he would ultimately be on the losing side."
          }, 
          {
            "type": "img",
            "src": "image/cole_inter_2.png",
            "title": "Cole Palmer's goal in the Euro 2024 final",
            "desc": ""
          },
          {
            "type": "p",
            "text": "In October 2024, Palmer was announced as the winner of a supporters' vote for the 2023/24 England Men’s Player of the Year award. He finished ahead of Real Madrid's Jude Bellingham and Arsenal's Bukayo Saka in the poll."
          }
        ]
      }
    ]
  }
}